In [1]:
#Handling missing values

In [2]:
import pandas as pd
train_df = pd.read_csv(r'C:\Users\Vaibhav\Desktop\BA\Datasets\titanic_train.csv')
unknown_df = pd.read_csv('C:/Users/Vaibhav/Desktop/BA/Datasets/titanic_test.csv')

In [3]:
train_df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [4]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [5]:
unknown_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [6]:
unknown_df['Survived'] = -888

In [7]:
unknown_df.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,-888
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,-888
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,-888

In [8]:
train_df.shape, unknown_df.shape

((891, 12), (420, 12))

In [9]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [10]:
df.shape

(1311, 12)

In [11]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282

In [12]:
df.tail(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,-888,2668
418,34.5,NaN,Q,7.8292,"Kelly, Mr. James",0,1310,3,male,0,-888,330911
419,47.0,NaN,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,1311,3,female,1,-888,363272

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1048 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1310 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 133.1+ KB

#### Prerequisits for sklearn library:
1. either numpy array or panda dataframe format
2. no missing values
3. all numerical data

Data preprocessing steps:
- structured data
- no missing values
- remove the outliers
- understand the variables which are leading to high variance in the Dependent variable
- understand the inter-correlations between the IVs, because correlated variables are communicating redundant information and lead to over-fitting
- feature engineering

In [14]:
df.isnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,False,True,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,True,False,False,False,False,False,False,False,False,False,False

In [15]:
df.notnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,True,False,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,False,True,True,True,True,True,True,True,True,True,True

In [16]:
import numpy as np
df.isnull().sum()

Age             263
Cabin          1016
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived          0
Ticket            0
dtype: int64

In [17]:
df.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282

In [18]:
df.notnull().head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,True,False,True,True,True,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True
2,True,False,True,True,True,True,True,True,True,True,True,True

In [19]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [20]:
#name and survival status for all the passengers having missing values in age
df.loc[df.Age.isnull(), ['Name', 'Survived']]

                                               Name  Survived
5                                  Moran, Mr. James         0
17                     Williams, Mr. Charles Eugene         1
19                          Masselmani, Mrs. Fatima         1
26                          Emir, Mr. Farred Chehab         0
28                    O'Dwyer, Miss. Ellen "Nellie"         1
29                              Todoroff, Mr. Lalio         0
31   Spencer, Mrs. William Augustus (Marie Eugenie)         1
32                         Glynn, Miss. Mary Agatha         1
36                                 Mamee, Mr. Hanna         1
42                              Kraeff, Mr. Theodor         0
45                         Rogers, Mr. William John         0
46                                Lennon, Mr. Denis         0
47                        O'Driscoll, Miss. Bridget         1
48                              Samaan, Mr. Youssef         0
55                                Woolner, Mr. Hugh         1
64                            Stewart, Mr. Albert A         0
65                         Moubarek, Master. Gerios         1
76                                Staneff, Mr. Ivan         0
77                         Moutal, Mr. Rahamin Haim         0
82                   McDermott, Miss. Brigdet Delia         1
87                    Slocovski, Mr. Selman Francis         0
95                      Shorney, Mr. Charles Joseph         0
101                Petroff, Mr. Pastcho ("Pentcho")         0
107                          Moss, Mr. Albert Johan         1
109                             Moran, Miss. Bertha         1
121                      Moore, Mr. Leonard Charles         0
126                             McMahon, Mr. Martin         0
128                               Peter, Miss. Anna         1
140                   Boulos, Mrs. Joseph (Sultana)         0
154                           Olsen, Mr. Ole Martin         0
..                                              ...       ...
268                     Howard, Miss. May Elizabeth      -888
271                                Fox, Mr. Patrick      -888
273                              Lennon, Miss. Mary      -888
274                           Saade, Mr. Jean Nassr      -888
282                           Fleming, Miss. Honora      -888
286          Franklin, Mr. Charles (Charles Fardon)      -888
288                         Mardirosian, Mr. Sarkis      -888
289                                Ford, Mr. Arthur      -888
290             Rheims, Mr. George Alexander Lucien      -888
292                               Nasr, Mr. Mustafa      -888
297                               Samaan, Mr. Hanna      -888
301                             Malachard, Mr. Noel      -888
304               McCarthy, Miss. Catherine Katie""      -888
312                             Sadowitz, Mr. Harry      -888
332                             Thomas, Mr. Tannous      -888
339                           Betros, Master. Seman      -888
342                           Sage, Mr. John George      -888
344             van Billiard, Master. James William      -888
357                             Lockyer, Mr. Edward      -888
358                            O'Keefe, Mr. Patrick      -888
365                  Sage, Mrs. John (Annie Bullen)      -888
366                               Caram, Mr. Joseph      -888
380                           O'Connor, Mr. Patrick      -888
382                      Risien, Mrs. Samuel (Emma)      -888
384                  Wheeler, Mr. Edwin Frederick""      -888
408                 Riordan, Miss. Johanna Hannah""      -888
410                          Naughton, Miss. Hannah      -888
413                              Spector, Mr. Woolf      -888
416                             Ware, Mr. Frederick      -888
417                        Peter, Master. Michael J      -888

[263 rows x 2 columns]

In [21]:
#to delete all the rows having null values
titanic_nona = df.dropna()

In [22]:
titanic_nona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 270 entries, 1 to 414
Data columns (total 12 columns):
Age            270 non-null float64
Cabin          270 non-null object
Embarked       270 non-null object
Fare           270 non-null float64
Name           270 non-null object
Parch          270 non-null int64
PassengerId    270 non-null int64
Pclass         270 non-null int64
Sex            270 non-null object
SibSp          270 non-null int64
Survived       270 non-null int64
Ticket         270 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 27.4+ KB

In [23]:
df.Age.isnull().sum()

263

In [24]:
df.Age.mean(skipna=True)

29.901879770992366

In [25]:
df['Age'] = df['Age'].fillna(20)
df['Age'] = df['Age'].fillna(df.Age.mean(skipna=True))
df['Age'] = df['Age'].fillna(df.Age.median(skipna=True))

In [26]:
df[['Age']].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 1 columns):
Age    1311 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

In [27]:
# how to impute nas for a factor var

In [28]:
df.Embarked.value_counts(dropna=False) #if I do dropna = False, we get the freq of nans

S      915
C      270
Q      124
NaN      2
Name: Embarked, dtype: int64

In [29]:
df.Embarked = df.Embarked.fillna('S')

In [30]:
df[["Fare"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 1 columns):
Fare    1310 non-null float64
dtypes: float64(1)
memory usage: 20.5 KB

----

### Imputer class for numerical variables

In [31]:
from sklearn.preprocessing import Imputer

In [32]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [33]:
np.where(df.Age.isnull())

(array([   5,   17,   19,   26,   28,   29,   31,   32,   36,   42,   45,
          46,   47,   48,   55,   64,   65,   76,   77,   82,   87,   95,
         101,  107,  109,  121,  126,  128,  140,  154,  158,  159,  166,
         168,  176,  180,  181,  185,  186,  196,  198,  201,  214,  223,
         229,  235,  240,  241,  250,  256,  260,  264,  270,  274,  277,
         284,  295,  298,  300,  301,  303,  304,  306,  324,  330,  334,
         335,  347,  351,  354,  358,  359,  364,  367,  368,  375,  384,
         388,  409,  410,  411,  413,  415,  420,  425,  428,  431,  444,
         451,  454,  457,  459,  464,  466,  468,  470,  475,  481,  485,
         490,  495,  497,  502,  507,  511,  517,  522,  524,  527,  531,
         533,  538,  547,  552,  557,  560,  563,  564,  568,  573,  578,
         584,  589,  593,  596,  598,  601,  602,  611,  612,  613,  629,
         633,  639,  643,  648,  650,  653,  656,  667,  669,  674,  680,
         692,  697,  709,  711,  718,  727,  732,  738,  739,  740,  760,
         766,  768,  773,  776,  778,  783,  790,  792,  793,  815,  825,
         826,  828,  832,  837,  839,  846,  849,  859,  863,  868,  878,
         888,  901,  913,  920,  924,  927,  930,  932,  938,  945,  949,
         956,  967,  974,  975,  976,  979,  982,  984,  993,  998,  999,
        1002, 1007, 1012, 1015, 1018, 1023, 1024, 1037, 1039, 1042, 1051,
        1054, 1059, 1061, 1064, 1074, 1079, 1082, 1090, 1091, 1096, 1102,
        1107, 1110, 1116, 1118, 1124, 1134, 1135, 1140, 1146, 1147, 1156,
        1157, 1158, 1159, 1162, 1164, 1165, 1173, 1177, 1179, 1180, 1181,
        1183, 1188, 1192, 1195, 1203, 1223, 1230, 1233, 1235, 1248, 1249,
        1256, 1257, 1271, 1273, 1275, 1299, 1301, 1304, 1307, 1308],
       dtype=int64),)

In [34]:
np.where(df.Fare.isnull())

(array([1043], dtype=int64),)

In [35]:
import sklearn

In [36]:
imp = sklearn.preprocessing.Imputer()

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [37]:
imp = Imputer(strategy = "median") #imp is an instance / object of imputer class
#strategy: mean/ median / most_frequent
#Imputer class can only be used for numerical variables
#For categorical variables, first convert into numerical dtype

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [38]:
df[["Fare", "Age"]]=imp.fit_transform(df[["Fare", "Age"]])
#fit method will only find out the respective median values and 
#   transform method will transform the data to impute the NAs with respective median values

In [39]:
#fit and transform methods seperately
#fit method will only find out the respective median values and 
#   transform method will transform the data to impute the NAs with respective median values

In [40]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1048 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1310 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 133.1+ KB

In [42]:
imputer = Imputer(missing_values='NaN', strategy = "median", axis = 0)
imputer.fit(df[['Fare', 'Age']]) #this will only compute the median

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='median', verbose=0)

In [43]:
df[['Fare', "Age"]].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 2 columns):
Fare    1310 non-null float64
Age     1048 non-null float64
dtypes: float64(2)
memory usage: 30.7 KB

In [44]:
df.median(axis = 0)#reduce on rows - and get the column wise mean

Age             28.0000
Fare            14.4542
Parch            0.0000
PassengerId    656.0000
Pclass           3.0000
SibSp            0.0000
Survived         0.0000
dtype: float64

In [45]:
df[['Fare', 'Age']] = imputer.transform(df[['Fare', 'Age']]) #to transform the column Fare

In [46]:
df.iloc[1043,3], df.Fare.median(skipna=True), df.iloc[5,0], df.Age.median(skipna=True)

(14.4542, 14.4542, 28.0, 28.0)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1311 entries, 0 to 419
Data columns (total 12 columns):
Age            1311 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null object
Fare           1311 non-null float64
Name           1311 non-null object
Parch          1311 non-null int64
PassengerId    1311 non-null int64
Pclass         1311 non-null int64
Sex            1311 non-null object
SibSp          1311 non-null int64
Survived       1311 non-null int64
Ticket         1311 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 173.1+ KB

---

### IMPLEMENTING IMPUTER CLASS FOR CATEGORICAL COLUMNS

In [48]:
imp = Imputer(strategy = "most_frequent") #imp is an instance / object of imputer class

C:\Users\Vaibhav\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:66: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [49]:
df.Embarked = df.Embarked.astype("category")

In [50]:
df.Embarked = df.Embarked.cat.codes

In [51]:
df.Embarked.value_counts(dropna = False)

 2    915
 0    270
 1    124
-1      2
Name: Embarked, dtype: int64

In [52]:
df.loc[df.Embarked == -1, "Embarked"] = np.NaN

In [109]:
df.Embarked.value_counts(dropna = False)

S      915
C      270
Q      124
NaN      2
Name: Embarked, dtype: int64

In [53]:
df.Embarked = df.Embarked.astype(np.float64)

In [54]:
df[['Embarked']] = imp.fit_transform(df[['Embarked']])

---

### Transform Method

In [55]:
df = pd.concat((train_df, unknown_df), axis = 0)

C:\Users\Vaibhav\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [56]:
df.Age.isnull().sum()

263

In [57]:
#if it is female (i.e for the missing value of age) - then the median age of the female 
#will be imputed and if it male, then the median age of males will be imputed
df.groupby('Sex').Age. median()

Sex
female    27.0
male      28.0
Name: Age, dtype: float64

In [58]:
df.Age = df.groupby('Sex').Age.transform('median')

In [59]:
df.Age.isnull().sum() #Age imputed by the median age represented by the sex

0

In [60]:
df.groupby("Pclass").Age.mean()

Pclass
1    27.554180
2    27.617329
3    27.694796
Name: Age, dtype: float64

In [61]:
df.groupby('Pclass').Age.transform('mean')

0      27.694796
1      27.554180
2      27.694796
3      27.554180
4      27.694796
5      27.694796
6      27.554180
7      27.694796
8      27.694796
9      27.617329
10     27.694796
11     27.554180
12     27.694796
13     27.694796
14     27.694796
15     27.617329
16     27.694796
17     27.617329
18     27.694796
19     27.694796
20     27.617329
21     27.617329
22     27.694796
23     27.554180
24     27.694796
25     27.694796
26     27.694796
27     27.554180
28     27.694796
29     27.694796
         ...
390    27.554180
391    27.554180
392    27.694796
393    27.617329
394    27.694796
395    27.554180
396    27.694796
397    27.554180
398    27.694796
399    27.694796
400    27.554180
401    27.617329
402    27.554180
403    27.554180
404    27.554180
405    27.617329
406    27.617329
407    27.554180
408    27.694796
409    27.694796
410    27.694796
411    27.554180
412    27.694796
413    27.694796
414    27.554180
415    27.694796
416    27.694796
417    27.694796
418    27.694796
419    27.694796
Name: Age, Length: 1311, dtype: float64

In [62]:
#replace the median age according to the title

In [63]:
df.Name[:3]

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object

In [64]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [65]:
name = df.iloc[0, 4]

In [66]:
name

'Braund, Mr. Owen Harris'

In [67]:
name.split(",")[1].split(" ")[1].split(".")[0].lower()

'mr'

In [68]:
def GetTitle(name):
    title = name.split(",")[1].split(" ")[1].split(".")[0].lower()
    
        
    
    return(title)

In [69]:
GetTitle(name)

'mr'

In [70]:
df['Title'] = df.Name.map(lambda x: GetTitle(x))

In [71]:
df.Title.value_counts()

mr          758
miss        260
mrs         198
master       61
dr            8
rev           8
col           4
major         2
ms            2
mlle          2
the           1
jonkheer      1
mme           1
dona          1
lady          1
don           1
sir           1
capt          1
Name: Title, dtype: int64

In [72]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [73]:
df.Title

0          mr
1         mrs
2        miss
3         mrs
4          mr
5          mr
6          mr
7      master
8         mrs
9         mrs
10       miss
11       miss
12         mr
13         mr
14       miss
15        mrs
16     master
17         mr
18        mrs
19        mrs
20         mr
21         mr
22       miss
23         mr
24       miss
25        mrs
26         mr
27         mr
28       miss
29         mr
        ...
390        mr
391       mrs
392    master
393        mr
394        mr
395       mrs
396        mr
397       mrs
398        mr
399        mr
400      miss
401        mr
402      miss
403        mr
404        mr
405        mr
406        mr
407        mr
408      miss
409      miss
410      miss
411       mrs
412      miss
413        mr
414      dona
415        mr
416        mr
417    master
418        mr
419       mrs
Name: Title, Length: 1311, dtype: object

In [74]:
df.Title.unique()

array(['mr', 'mrs', 'miss', 'master', 'don', 'rev', 'dr', 'mme', 'ms',
       'major', 'lady', 'sir', 'mlle', 'col', 'capt', 'the', 'jonkheer',
       'dona'], dtype=object)

In [75]:
#Mr, Mrs, Miss, Master, Sir, Officer, Lady 
title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}

In [76]:
title_group['master']

'Master'

In [77]:
def GetTitle(name):
    title = name.split(',')[1].split('.')[0].strip().lower()
    
    
    title_group = { 'mr' : 'Mr',
               'mrs' : 'Mrs',
               'miss':'Miss',
               'master': 'Master',
               'don': 'Sir',
               'rev': 'Sir',
               'dr': 'Officer',
               'mme': 'Mrs',
               'ms': 'Mrs',
               'major': 'Officer',
               'lady': 'Lady',
               'sir': 'Sir',
               'mlle': 'Miss',
               'col': 'Officer',
               'capt': 'Officer',
               'the countess': 'Lady',
               'jonkheer': 'Sir',
               'dona': 'Lady'}
        
    
    return(title_group[title])

In [78]:
GetTitle(name)

'Mr'

In [79]:
df['Title']=df.Name.map(lambda x: GetTitle(x))

In [80]:
df['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Sir', 'Officer', 'Lady'],
      dtype=object)

In [81]:
df.Title.value_counts()

Mr         758
Miss       262
Mrs        201
Master      61
Officer     15
Sir         11
Lady         3
Name: Title, dtype: int64

In [82]:
df.groupby("Title").Age.median()

Title
Lady       27.0
Master     28.0
Miss       27.0
Mr         28.0
Mrs        27.0
Officer    28.0
Sir        28.0
Name: Age, dtype: float64

In [83]:
df.Age = df.groupby("Title").Age.transform("median")

In [84]:
df.groupby(['Title',"Pclass"]).Age.median().unstack()

Pclass      1     2     3
Title
Lady     27.0   NaN   NaN
Master   28.0  28.0  28.0
Miss     27.0  27.0  27.0
Mr       28.0  28.0  28.0
Mrs      27.0  27.0  27.0
Officer  28.0  28.0   NaN
Sir      28.0  28.0   NaN

In [85]:
df.groupby(['Title',"Pclass"]).Fare.transform('median')[:3]

0     7.8958
1    78.1125
2     8.0500
Name: Fare, dtype: float64

In [86]:
df.Cabin.unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148', 'B45', 'B36', 'A21', 'D34', 'A9', 'C31', 'B61', 'C53',
       'D43', 'C130', 'C132', 'C55 C57', 'C116', 'F', 'A29', 'C6', 'C28',
       'C51', 'C97', 'D22', 'B10', 'E45', 'E52', 'A11', 'B11', 'C80',
       'C89', 'F E46', 'B26', 'F E57', 'A18', 'E60', 'E39 E41',
       'B52 B54 B56', 'C39', 'B24', 'D40', 'D38', 'C105'], dtype=object)

In [87]:
np.sum(df[['Cabin']].isnull())

Cabin    1016
dtype: int64

In [88]:
df[df.Cabin=='T']

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
339,28.0,T,S,35.5,"Blackwell, Mr. Stephen Weart",0,340,1,male,0,0,113784,Mr

In [89]:
df.loc[df.Cabin=='T', 'Cabin'] = np.NaN

In [90]:
df.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [91]:
df.head(2)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
0,28.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171,Mr
1,27.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599,Mrs

In [92]:
df.reset_index(inplace = True)

In [93]:
df.drop("index", axis = 1, inplace = True)

In [94]:
deck = df.loc[1,"Cabin"]

In [95]:
deck

'C85'

In [96]:
deck[0].upper()

'C'

In [97]:
np.where(df.Cabin.notnull(), 'x', 'y') #where-ever true is returned by the condition, put x else put y

array(['y', 'x', 'y', ..., 'y', 'y', 'y'], dtype='<U1')

In [100]:
np.where(pd.notnull(df.Cabin), str(deck)[0].upper(), 'Z')

array(['Z', 'C', 'Z', ..., 'Z', 'Z', 'Z'], dtype='<U1')

In [101]:
#deck = "C85"
def getdeck(deck):
    a = np.where(pd.notnull(deck), str(deck)[0].upper(), 'Z') 
    #important to convert the np.nan to string
    return a

In [102]:
df['Deck'] = df['Cabin'].map(lambda x: getdeck(x))

In [103]:
print(df.Deck)

0       Z
1       C
2       Z
3       C
4       Z
5       Z
6       E
7       Z
8       Z
9       Z
10      G
11      C
12      Z
13      Z
14      Z
15      Z
16      Z
17      Z
18      Z
19      Z
20      Z
21      D
22      Z
23      A
24      Z
25      Z
26      Z
27      C
28      Z
29      Z
       ..
1281    B
1282    D
1283    Z
1284    Z
1285    Z
1286    C
1287    Z
1288    B
1289    Z
1290    Z
1291    C
1292    Z
1293    Z
1294    Z
1295    D
1296    D
1297    Z
1298    C
1299    Z
1300    Z
1301    Z
1302    C
1303    Z
1304    Z
1305    C
1306    Z
1307    Z
1308    Z
1309    Z
1310    Z
Name: Deck, Length: 1311, dtype: object

In [104]:
#crosstab to find the survival rate according to cabin
pd.crosstab(df[df.Survived!= -888].Survived , df[df.Survived!= -888].Deck)
# We have to find out if deck is a significant variable in predicting the survival rate. This can be predicted only if as the deck varies, survival rate varies significantly

Deck      A   B   C   D   E  F  G    Z
Survived
0         8  12  24   8   8  5  2  482
1         7  35  35  25  24  8  2  206

In [105]:
#survival rate for deck A? 7/15
7/15

0.4666666666666667

In [106]:
35/47

0.7446808510638298

In [107]:
24/59

0.4067796610169492